Titleblocks can only be placed on sheets.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId TitleblockBadViewType { get; }
  Visual Basic
Public Shared ReadOnly Property TitleblockBadViewType As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ TitleblockBadViewType {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FamilyFailures Class
  Autodesk.Revit.DB Namespace